/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strncmp.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: dsagong <marvin@42.fr>                     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/04/02 13:24:30 by dsagong           #+#    #+#             */
/*   Updated: 2025/04/09 15:52:27 by dsagong          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int	ft_strncmp(const char *s1, const char *s2, size_t n)
{
	while (n > 0 && *s1 && (*s1 == *s2))
	{
		s1++;
		s2++;
		n--;
	}
	if (n == 0)
		return (0);
	return ((unsigned char)*s1 - (unsigned char)*s2);
}

//strncmp("abc", "abd", 0)을 실행하면 0이 나와야 하는데, 'c' - 'd' = -1이 나올 수도 있음.
//n == 0이면 비교 없이 0을 리턴
//strncmp("abc", "abd", 0)을 실행하면 0이 정확히 반환됨
